In [3]:
import pandas as pd
import numpy as np
df1=pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df1

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

--- 
EX 1

In [6]:
df1

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

--- 
EX 2

In [266]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_data

{'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'name': ['Anastasia',
  'Dima',
  'Katherine',
  'James',
  'Emily',
  'Michael',
  'Matthew',
  'Laura',
  'Kevin',
  'Jonas'],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
 'score': [12.5, 9, 16.5, nan, 9, 20, 14.5, nan, 8, 19]}

In [267]:
df=pd.DataFrame(exam_data,"a b c d e f g h i j".split())
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

--- 
EX 3

Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
attempts    10 non-null int64
name        10 non-null object
qualify     10 non-null object
score       8 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 280.0+ bytes

--- 
EX 4

Write a Pandas program to get the first 3 rows of a given DataFrame

In [13]:
df.head(3)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

--- 
EX 5

 Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame

In [14]:
df[["name","score"]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

--- 
EX 6

Write a Pandas program to select the specified columns and rows from a given data frame
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [27]:
df.iloc[[1,3,5,6]][["name","score"]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [34]:
df.iloc[[1,3,5,6],[1,3]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

--- 
EX 7

Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

In [37]:
df[df["attempts"]>2]

   attempts     name qualify  score
b         3     Dima      no    9.0
d         3    James      no    NaN
f         3  Michael     yes   20.0

--- 
EX 8

Write a Pandas program to count the number of rows and columns of a DataFrame.

In [47]:
print("num of rows")
df.index.size
total_rows=len(df.axes[0])
len(df)

num of rows

10

In [49]:
print("num of cols")
df.columns.size
total_cols=len(df.axes[1])

num of cols

4

--- 
EX 9

Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [53]:
df["score"]

a    12.5
b     9.0
c    16.5
d     NaN
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

In [54]:
np.isnan(df["score"])

a    False
b    False
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: score, dtype: bool

In [55]:
df[np.isnan(df["score"])]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

--- 
EX 10

Write a Pandas program to select the rows the score is between 15 and 20 (inclusive)

In [64]:
df[(df["score"]>15) & (df["score"]<=20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

--- 
EX 11

 Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [65]:
df[(df["attempts"]<2) & (df["score"]>15)]

   attempts   name qualify  score
j         1  Jonas     yes   19.0

--- 
EX 12

Write a Pandas program to change the score in row 'd' to 11.5

In [69]:
df.loc["d"]["score"]=11.5 # will not work
df

C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [72]:
df.loc['d', 'score'] = 11.5
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

--- 
EX 13

Write a Pandas program to calculate the sum of the examination attempts by the students

In [74]:
df["attempts"].sum()

19

--- 
EX 14

 Write a Pandas program to calculate the mean score for each different student in DataFrame

In [75]:
df["score"].mean()

13.333333333333334

 ---
 EX 15
 
Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame

In [77]:
df.loc["k"]=[2,"Matan","yes",15.0]

In [78]:
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0
k         2      Matan     yes   15.0

In [80]:
df.drop("k",axis=0,inplace=True)

In [81]:
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

 ---
 EX 16
 
 Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [93]:
print(" first by 'name' in descending order, then by 'score' in ascending order.")
df.sort_values(by=["name","score"],ascending=[False,True])

 first by 'name' in descending order, then by 'score' in ascending order.

   attempts       name qualify  score
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
c         2  Katherine     yes   16.5
j         1      Jonas     yes   19.0
d         3      James      no   11.5
e         2      Emily      no    9.0
b         3       Dima      no    9.0
a         1  Anastasia     yes   12.5

In [90]:
print("acsending")
df.sort_values(by=["name","score"])

acsending

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
e         2      Emily      no    9.0
d         3      James      no   11.5
j         1      Jonas     yes   19.0
c         2  Katherine     yes   16.5
i         2      Kevin      no    8.0
h         1      Laura      no    NaN
g         1    Matthew     yes   14.5
f         3    Michael     yes   20.0

In [91]:
print("descending")
df.sort_values(by=["name","score"],ascending=False)

descending

   attempts       name qualify  score
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
c         2  Katherine     yes   16.5
j         1      Jonas     yes   19.0
d         3      James      no   11.5
e         2      Emily      no    9.0
b         3       Dima      no    9.0
a         1  Anastasia     yes   12.5

 ---
 EX 17
 
 Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [136]:
df["qualify"][df["qualify"]=="yes"]=True
df["qualify"][df["qualify"]=="no"]=False

C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [134]:
df["name"][df["name"]=="Dima"]="Matan"

C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [137]:
df

   attempts       name qualify  score
a         1  Anastasia    True   12.5
b         3      Matan   False    9.0
c         2  Katherine    True   16.5
d         3      James   False    NaN
e         2      Emily   False    9.0
f         3    Michael    True   20.0
g         1    Matthew    True   14.5
h         1      Laura   False    NaN
i         2      Kevin   False    8.0
j         1      Jonas    True   19.0

In [143]:
print("\nReplace the qualify' column contains the values 'yes' and 'no'  with True and  False:")
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

Replace the qualify' column contains the values 'yes' and 'no'  with True and  False:
   attempts       name  qualify  score
a         1  Anastasia     True   12.5
b         3       Dima    False    9.0
c         2  Katherine     True   16.5
d         3      James    False    NaN
e         2      Emily    False    9.0
f         3    Michael     True   20.0
g         1    Matthew     True   14.5
h         1      Laura    False    NaN
i         2      Kevin    False    8.0
j         1      Jonas     True   19.0

 ---
 EX 18
 
Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame

In [168]:
df["name"][df["name"]=="James"]="Matan"
#or df['name'] = df['name'].replace('James', 'Suresh')
df

C:\ProgramData\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      Matan      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

 ---
 EX 19
 
Write a Pandas program to delete the 'attempts' column from the DataFrame

In [169]:
attemps_col=df["attempts"]

In [172]:
df.drop("attempts",axis=1,inplace=False)

        name qualify  score
a  Anastasia     yes   12.5
b       Dima      no    9.0
c  Katherine     yes   16.5
d      Matan      no    NaN
e      Emily      no    9.0
f    Michael     yes   20.0
g    Matthew     yes   14.5
h      Laura      no    NaN
i      Kevin      no    8.0
j      Jonas     yes   19.0

 ---
 EX 20
 
Write a Pandas program to insert a new column in existing DataFrame

In [4]:
colors=pd.Series(index="a b c d e f g h i j".split(),data=np.take(["blue","yellow","red","black","pink"], np.random.randint(5, size=10)))
colors

a    yellow
b       red
c    yellow
d      pink
e       red
f       red
g    yellow
h       red
i    yellow
j     black
dtype: object

In [219]:
df["colors"]=colors

In [220]:
df

   attempts       name qualify  score colors
a         1  Anastasia     yes   12.5  black
b         3       Dima      no    9.0   blue
c         2  Katherine     yes   16.5    red
d         3      Matan      no    NaN    red
e         2      Emily      no    9.0   pink
f         3    Michael     yes   20.0   blue
g         1    Matthew     yes   14.5   pink
h         1      Laura      no    NaN   blue
i         2      Kevin      no    8.0  black
j         1      Jonas     yes   19.0    red

 ---
 EX 21
 
Write a Pandas program to iterate over rows in a DataFrame.

In [225]:
for index, row in df.iterrows():
    print("index= ",index)
    print("row information= ",row['name'], row['score'])

('index= ', 'a')
('row information= ', 'Anastasia', 12.5)
('index= ', 'b')
('row information= ', 'Dima', 9.0)
('index= ', 'c')
('row information= ', 'Katherine', 16.5)
('index= ', 'd')
('row information= ', 'Matan', nan)
('index= ', 'e')
('row information= ', 'Emily', 9.0)
('index= ', 'f')
('row information= ', 'Michael', 20.0)
('index= ', 'g')
('row information= ', 'Matthew', 14.5)
('index= ', 'h')
('row information= ', 'Laura', nan)
('index= ', 'i')
('row information= ', 'Kevin', 8.0)
('index= ', 'j')
('row information= ', 'Jonas', 19.0)

 ---
 EX 22
 
Write a Pandas program to get list from DataFrame column headers

In [228]:
list(df.columns)

['attempts', 'name', 'qualify', 'score', 'colors']

 ---
 EX 23
 
 Write a Pandas program to rename columns of a given DataFrame

In [254]:
#df.rename(columns={'oldName1': 'newName1', 'oldName2': 'newName2'}, inplace=True)

In [257]:
df.rename(columns={'name': 'Name'}, inplace=True)

In [256]:
df

   attempts       Name qualify  score colors
a         1  Anastasia     yes   12.5  black
b         3       Dima      no    9.0   blue
c         2  Katherine     yes   16.5    red
d         3      Matan      no    NaN    red
e         2      Emily      no    9.0   pink
f         3    Michael     yes   20.0   blue
g         1    Matthew     yes   14.5   pink
h         1      Laura      no    NaN   blue
i         2      Kevin      no    8.0  black
j         1      Jonas     yes   19.0    red

 ---
 EX 25
 
 Write a Pandas program to change the order of a DataFrame columns.

In [262]:
dff=pd.DataFrame({"col1":[1,4,3,4,5],"col2":[4,5,6,7,8],"col3":[7,8,9,0,1]})
dff

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [260]:
dff = dff[['col3', 'col2', 'col1']]
dff

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

 ---
 EX 27
 
 Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [ ]:
dff.to_csv('new_file.csv', sep='\t', index=False)

---

EX 30

Write a Pandas program to widen output display to see more columns.

In [ ]:
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

---

EX 32

Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe

In [265]:
df["score"].fillna(0)

a    12.5
b     9.0
c    16.5
d     0.0
e     9.0
f    20.0
g    14.5
h     0.0
i     8.0
j    19.0
Name: score, dtype: float64

---

EX 35

Write a Pandas program to count the NaN values in one or more columns in DataFrame

In [277]:
df["score"].isna().sum()

2

---

EX 37

Write a Pandas program to reset index in a given DataFrame.

In [24]:
ser1=colors
ser1

a    yellow
b       red
c    yellow
d      pink
e       red
f       red
g    yellow
h       red
i    yellow
j     black
dtype: object

In [19]:
ser1=ser1.reset_index()
ser1

   level_0 index       0
0        0     a  yellow
1        1     b     red
2        2     c  yellow
3        3     d    pink
4        4     e     red
5        5     f     red
6        6     g  yellow
7        7     h     red
8        8     i  yellow
9        9     j   black

In [21]:
ser1.set_index("index")

       level_0       0
index
a            0  yellow
b            1     red
c            2  yellow
d            3    pink
e            4     red
f            5     red
g            6  yellow
h            7     red
i            8  yellow
j            9   black

---

EX 38

 Write a Pandas program to devide a DataFrame in a given ratio
 ratio= 70% and the rest 30%

In [71]:
df1=pd.DataFrame(ser1,columns=["colors"])
df1["len"]=df1["colors"].apply(len)
df1=df1.sort_values(by=["len"])
df1

   colors  len
b     red    3
e     red    3
f     red    3
h     red    3
d    pink    4
j   black    5
a  yellow    6
c  yellow    6
g  yellow    6
i  yellow    6

In [82]:
print("70%")
df1.head(int(0.7*len(df1)))

70%

   colors  len
b     red    3
e     red    3
f     red    3
h     red    3
d    pink    4
j   black    5
a  yellow    6

In [83]:
print("30%")
df1.tail(int(0.3*len(df1)))

30%

   colors  len
c  yellow    6
g  yellow    6
i  yellow    6

In [85]:
part_70 = df1.sample(frac=0.7,random_state=10)
part_70

   colors  len
g  yellow    6
f     red    3
j   black    5
a  yellow    6
h     red    3
e     red    3
b     red    3

In [86]:
part_30 = df1.drop(part_70.index)
part_30

   colors  len
d    pink    4
c  yellow    6
i  yellow    6

    ---

EX 39

Write a Pandas program to combining two series into a DataFrame.

In [87]:
ser1=pd.Series({"a":1,"b":2,"c":3})
ser2=pd.Series({"d":4,"e":5,"f":6})

In [131]:
together=pd.concat([ser1.reset_index(),ser2.reset_index()],axis=1).drop(columns=["index"])
together.columns=["AA","BB"]
together

   AA  BB
0   1   4
1   2   5
2   3   6

    ---

EX 40

40. Write a Pandas program to shuffle a given DataFrame rows

In [132]:
df1

   colors  len
b     red    3
e     red    3
f     red    3
h     red    3
d    pink    4
j   black    5
a  yellow    6
c  yellow    6
g  yellow    6
i  yellow    6

In [134]:
df1.sample(frac=1)

   colors  len
d    pink    4
g  yellow    6
e     red    3
i  yellow    6
h     red    3
j   black    5
c  yellow    6
a  yellow    6
b     red    3
f     red    3

    ---
NEED TO CONTINUE FROM EX 41